In [119]:
input_one = "Hello World"

In [120]:
input_one = 4567
print(input_one)

4567

In [121]:
tuple_run2=((1,2,3),(4,5,6))
print(tuple_run2)

print(tuple_run2[0][1])

((1, 2, 3), (4, 5, 6))
2

In [122]:
dict_list = [{"name":"taste1","password":"1234"},
             {"name":"taste2","password":"4567"},
             {"name":"ohly","password":"2333"}]

In [123]:
print(dict_list)

[{'name': 'taste1', 'password': '1234'}, {'name': 'taste2', 'password': '4567'}, {'name': 'ohly', 'password': '2333'}]

In [124]:
for i in range(0,len(dict_list)):
    print(dict_list[i])

{'name': 'taste1', 'password': '1234'}
{'name': 'taste2', 'password': '4567'}
{'name': 'ohly', 'password': '2333'}

In [125]:
for list in dict_list:
    print(list)

{'name': 'taste1', 'password': '1234'}
{'name': 'taste2', 'password': '4567'}
{'name': 'ohly', 'password': '2333'}

In [126]:
for i in dict_list:
    print(i["password"])

1234
4567
2333

In [127]:
for i in dict_list:
    print(i["name"])

taste1
taste2
ohly

In [128]:
sum=0

while sum < len(dict_list):
    print(dict_list[sum]["name"])
    sum +=1

taste1
taste2
ohly

In [129]:
sum=0

while sum < len(dict_list):
    print(dict_list[sum]["password"])
    sum +=1

1234
4567
2333

In [130]:
#함수 def 함수명(매개변수,매개변수):
#함수를 호출 -> 함수명(인자,인자)
#함수를 만들어봅시다. -> 함수를 호출 -> dict_list print ->
#인자값에 키값을 넣어주고 ->그 키값에 해당하는 값만 출력이 되도록
dict_list = [{"name":"taste1","password":"1234"},
             {"name":"taste2","password":"4567"},
             {"name":"ohly","password":"2333"}]

def func_1(enter_key):
    for i in dict_list:
        print(i["password"])

In [131]:
func_1("name") # def func_1("password") -> print(list["password"])

1234
4567
2333

In [132]:
def func_1(input_key):
    for i in range(0,len(dict_list)):
	    print(dict_list[i][input_key])
     
     
len(dict_list)

3

In [133]:
#리스트 명과 키값을 넣었을 때 나오는 values값들 나오게하기
def out_values(list_,input_data):
    i=0
    while i < len(list_):
        
        print(list_[i][input_data])
        i +=1
out_values(dict_list,"password")

1234
4567
2333

In [134]:
def say_hi():
    return "Anyeong-Hase-yo"

print(say_hi())

Anyeong-Hase-yo

In [135]:
a=10 #a는 전역변수? 지역변수? ->전역변수
#인수 더하는 함수 만들기
def plus_num(input_a,input_b):
    result = input_a + input_b
    return result

plus_num(13,15)

28

In [136]:
def func_5():
    a = 10
    def func_6():
        print(a)
    func_6()
    
func_5()

10

In [137]:

def func_5():
a = 15
    def func_6():
        print(a)
    func_6()
 
func_5()

IndentationError: expected an indented block after function definition on line 1 (2435519891.py, line 2)

In [ ]:
#함수를 생성 ->매개변수 3개->def 함수1(a,b,c): ->
#함수 안에 함수를 하나 더 생성-> 함수1-> a+b ->
#함수 2-> a+b더해준 값에 c를 빼주는 함수를 만들어봅시다

In [ ]:
def func_6(a,b,c):
    sum = a+b
    def func_7():
        result= sum -c
        return result
    print(func_7())
    
func_6(12,12,10)

14

In [ ]:
#함수 각각 따로 2개 만들기
# 위와 같은 값 얻기
def func_8(a,b):
    sum = a+b
    return sum

def func_9(a,b,c,):
    minus= func_8(a,b) - c
    return minus


func_9(12,12,10)

14

In [ ]:
#함수를 3개 생성
# 함수1-> 두 수의 합
# 함수2-> 두 수의 차
# 함수3-> def 함수3(a,b,c): -> c의 값이 'S'면 함수1의 a,b값을 출력
# c의 값이 'D'이면 함수2(a,b)->호출 -->print(함수1)
abs(7-10)

In [ ]:
def func_10(a,b):
    sum = a+b
    return sum

def func_11(a,b):
    min = abs(a-b)
    return min

def func_12(a,b,c):
    if c=="S":
        result= func_10(a,b)
        return result
    elif c=="D":
        result= func_11(a,b)
        return result
    
    else:
        print("S나 D를 입력하세요!")
    
func_12(1,2,"e")

S나 D를 입력하세요!

In [ ]:

for i in range(1,15):
    sum += i
print(sum)
    
14//2

318

7

In [ ]:
#함수3개 생성 -> 입력 2개 a ~ b , c= "짝수","홀수"
#c값에 따라 a~b사이의 홀수, 짝수 반환
#반환되는 값의 데이터형태는 자유

def func_18(a,b):
    for i in range(a,b+1):
        if i%2==0:
            result=print(i)
    return result

def func_19(a,b):
    for i in range(a,b+1):
        if i%2==1:
            result=print(i)
    return result    






def func_17(a,b,c):
    if c//2==1:
        result = func_18(a,b)
        return result
    elif c//2==0:
        result = func_19(a,b)
        return result


func_17(1,14,2)

2
4
6
8
10
12
14

In [ ]:
#함수에 리스트 넣어서 리스트화 시키기
#함수 3개 만들어서 위에랑 똑같은 출력값 나올 수 있도록 하기._list_2 = []
list_=[]

def func_23(a,b):
    for i in range(a,b+1):
        if i%2==0:
            list_.append(i)
    return list_
def func_24(a,b):
    for i in range(a,b+1):
        if i%2==1:
            list_.append(i)
    return list_
def func_25(a,b,c):
    if c=="짝수":
        return func_23(a,b)
    elif c=="홀수":
        return func_24(a,b)
    
func_25(35,42,"홀수")

[35, 37, 39, 41]

In [ ]:
def func_14(a,b):
    _list_2=[]
    for i in range(a,b+1):
        if i% 2==0:
            _list_2.append(i)
    print(_list_2)

            
def func_15(a,b):
    _list_2=[]
    for i in range(a,b+1):
        if i%2==1:
            _list_2.append(i)
    print(_list_2)

def func_16(a,b,c):
    _list_2=[]
    if c %2 == 0 :
        return func_14(a,b)
    elif c % 2==1:
        return func_15(a,b)
    print(_list_2)
    
func_16(1,10,1)

[1, 3, 5, 7, 9]

In [ ]:
import pandas as pd

   A
1  a

In [ ]:

# index,column,value 지정->pd.DataFrame(value, index='index',column='column')
df_1=pd.DataFrame(['a'],index=[1],columns=['A'])

df_1
 #print 안쳐도 나옴

   A
1  a

In [ ]:
df_2=pd.DataFrame([['a','b','c']],index=['A'],columns=['A','B','C'])
#값을 한번에 넣을 때는 대괄호를 두번해서 넣어줘야함.
df_2

   A  B  C
A  a  b  c

In [ ]:
df_3=pd.DataFrame(['a','b','c'],index=['A','B','C'],columns=['A'])

df_3

   A
A  a
B  b
C  c

In [138]:
#변수 df_2에 
df_1['b']=['B']
df_1

   A  b
1  a  B

In [139]:
df_1['B']=[13]
df_1

   A  b   B
1  a  B  13

In [140]:
df_1['B']="A"
df_1

   A  b  B
1  a  B  A

In [146]:
df_3['A']['B']

'b'

In [144]:
df_3.A.B

'b'

In [150]:
df_1.columns = ["A","b","C"]
df_1

   A  b  C
1  a  B  A

In [151]:
df_1

   A  b  C
1  a  B  A

In [168]:
values=[["test1",20000],["test2",10000],["test3",30000]]
columns=["name","pay"]
df_9=pd.DataFrame(values,columns=columns)
df_9

    name    pay
0  test1  20000
1  test2  10000
2  test3  30000

In [175]:
df_9.sort_values('pay')

    name    pay
1  test2  10000
0  test1  20000
2  test3  30000

In [177]:
df_9.sort_values('pay',ascending=False)

    name    pay
2  test3  30000
0  test1  20000
1  test2  10000

In [179]:
df_9.sort_values('pay',ascending=True)

    name    pay
1  test2  10000
0  test1  20000
2  test3  30000

In [181]:
df_9.sort_index(ascending=False)

    name    pay
2  test3  30000
1  test2  10000
0  test1  20000

In [182]:
df_9.sort_values('name')

    name    pay
0  test1  20000
1  test2  10000
2  test3  30000

In [183]:
df_9.sort_values('name',ascending=False)

    name    pay
2  test3  30000
1  test2  10000
0  test1  20000

In [184]:
# 데이터 복사
df_10 =df_9.copy()
df_10

    name    pay
0  test1  20000
1  test2  10000
2  test3  30000

In [189]:
df_11=df_9.drop(index=[1],axis=0) #0은 행을 삭제,1은 열을 삭제

df_11

    name    pay
0  test1  20000
2  test3  30000

In [192]:
df_12=df_11.drop([0],axis=0)

df_12

    name    pay
2  test3  30000

In [197]:
df_10.to_csv('test_1.csv',encoding='utf-8')

In [200]:
df_10.to_csv('./templates/test_1.csv',encoding='utf-8') #../ 상위폴더 ./ 현재디렉토리

In [1]:
money=True
if money:
    print("택시를 타고가라")
else:
    print("걸어 가라")

택시를 타고가라

In [3]:
money=2000
if money >= 3000:
    print("택시를 타고 가라")
else:
    print("걸어 가라")

걸어 가라

In [4]:
money =2000
card = True
if money >= 3000 or card:
    print("택시를 타고 가라")
else:
    print("걸어 가라")

택시를 타고 가라